reports/k6_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m10s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m01.0s/1m10.0s

running (0m02.0s), 001/100 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 001/100 VUs  0m02.0s/1m10.0s

running (0m03.0s), 002/100 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 002/100 VUs  0m03.0s/1m10.0s

running (0m04.0s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 002/100 VUs  0m04.0s/1m10.0s

running (0m05.0s), 003/100 VUs, 6 complete and 0 interrupted iterations
default   [   7% ] 003/100 VUs  0m05.0s/1m10.0s

running (0m06.0s), 003/100 VUs, 9 complete and 0 interrupted iterations
default   [   9% ] 003/100 VUs  0m06.0s/1m10.0s

running (0m07.0s), 004/100 VUs, 12 complete and 0 interrupted iterations
default   [  10% ] 004/100 VUs  0m07.0s/1m10.0s

running (0m08.0s), 004/100 VUs, 16 complete and 0 interrupted iterations
default   [  11% ] 004/100 VUs  0m08.0s/1m10.0s

running (0m09.0s), 005/100 VUs, 20 complete and 0 interrupted iterations
default   [  13% ] 005/100 VUs  0m09.0s/1m10.0s

running (0m10.0s), 005/100 VUs, 25 complete and 0 interrupted iterations
default   [  14% ] 005/100 VUs  0m10.0s/1m10.0s

running (0m11.0s), 005/100 VUs, 30 complete and 0 interrupted iterations
default   [  16% ] 005/100 VUs  0m11.0s/1m10.0s

running (0m12.0s), 006/100 VUs, 35 complete and 0 interrupted iterations
default   [  17% ] 006/100 VUs  0m12.0s/1m10.0s

running (0m13.0s), 006/100 VUs, 41 complete and 0 interrupted iterations
default   [  19% ] 006/100 VUs  0m13.0s/1m10.0s

running (0m14.0s), 007/100 VUs, 47 complete and 0 interrupted iterations
default   [  20% ] 007/100 VUs  0m14.0s/1m10.0s

running (0m15.0s), 007/100 VUs, 54 complete and 0 interrupted iterations
default   [  21% ] 007/100 VUs  0m15.0s/1m10.0s

running (0m16.0s), 008/100 VUs, 61 complete and 0 interrupted iterations
default   [  23% ] 008/100 VUs  0m16.0s/1m10.0s

running (0m17.0s), 008/100 VUs, 69 complete and 0 interrupted iterations
default   [  24% ] 008/100 VUs  0m17.0s/1m10.0s

running (0m18.0s), 009/100 VUs, 77 complete and 0 interrupted iterations
default   [  26% ] 009/100 VUs  0m18.0s/1m10.0s

running (0m19.0s), 009/100 VUs, 86 complete and 0 interrupted iterations
default   [  27% ] 009/100 VUs  0m19.0s/1m10.0s

running (0m20.0s), 009/100 VUs, 95 complete and 0 interrupted iterations
default   [  29% ] 009/100 VUs  0m20.0s/1m10.0s

running (0m21.0s), 011/100 VUs, 104 complete and 0 interrupted iterations
default   [  30% ] 011/100 VUs  0m21.0s/1m10.0s

running (0m22.0s), 013/100 VUs, 115 complete and 0 interrupted iterations
default   [  31% ] 013/100 VUs  0m22.0s/1m10.0s

running (0m23.0s), 015/100 VUs, 128 complete and 0 interrupted iterations
default   [  33% ] 015/100 VUs  0m23.0s/1m10.0s

running (0m24.0s), 017/100 VUs, 143 complete and 0 interrupted iterations
default   [  34% ] 017/100 VUs  0m24.0s/1m10.0s

running (0m25.0s), 019/100 VUs, 160 complete and 0 interrupted iterations
default   [  36% ] 019/100 VUs  0m25.0s/1m10.0s

running (0m26.0s), 021/100 VUs, 179 complete and 0 interrupted iterations
default   [  37% ] 021/100 VUs  0m26.0s/1m10.0s

running (0m27.0s), 023/100 VUs, 200 complete and 0 interrupted iterations
default   [  39% ] 023/100 VUs  0m27.0s/1m10.0s

running (0m28.0s), 025/100 VUs, 223 complete and 0 interrupted iterations
default   [  40% ] 025/100 VUs  0m28.0s/1m10.0s

running (0m29.0s), 027/100 VUs, 248 complete and 0 interrupted iterations
default   [  41% ] 027/100 VUs  0m29.0s/1m10.0s

running (0m30.0s), 029/100 VUs, 275 complete and 0 interrupted iterations
default   [  43% ] 029/100 VUs  0m30.0s/1m10.0s

running (0m31.0s), 031/100 VUs, 304 complete and 0 interrupted iterations
default   [  44% ] 031/100 VUs  0m31.0s/1m10.0s

running (0m32.0s), 033/100 VUs, 335 complete and 0 interrupted iterations
default   [  46% ] 033/100 VUs  0m32.0s/1m10.0s

running (0m33.0s), 035/100 VUs, 368 complete and 0 interrupted iterations
default   [  47% ] 035/100 VUs  0m33.0s/1m10.0s

running (0m34.0s), 037/100 VUs, 403 complete and 0 interrupted iterations
default   [  49% ] 037/100 VUs  0m34.0s/1m10.0s

running (0m35.0s), 039/100 VUs, 440 complete and 0 interrupted iterations
default   [  50% ] 039/100 VUs  0m35.0s/1m10.0s

running (0m36.0s), 041/100 VUs, 479 complete and 0 interrupted iterations
default   [  51% ] 041/100 VUs  0m36.0s/1m10.0s

running (0m37.0s), 043/100 VUs, 520 complete and 0 interrupted iterations
default   [  53% ] 043/100 VUs  0m37.0s/1m10.0s

running (0m38.0s), 045/100 VUs, 563 complete and 0 interrupted iterations
default   [  54% ] 045/100 VUs  0m38.0s/1m10.0s

running (0m39.0s), 047/100 VUs, 608 complete and 0 interrupted iterations
default   [  56% ] 047/100 VUs  0m39.0s/1m10.0s

running (0m40.0s), 049/100 VUs, 655 complete and 0 interrupted iterations
default   [  57% ] 049/100 VUs  0m40.0s/1m10.0s

running (0m41.0s), 052/100 VUs, 703 complete and 0 interrupted iterations
default   [  59% ] 052/100 VUs  0m41.0s/1m10.0s

running (0m42.0s), 054/100 VUs, 755 complete and 0 interrupted iterations
default   [  60% ] 054/100 VUs  0m42.0s/1m10.0s

running (0m43.0s), 057/100 VUs, 809 complete and 0 interrupted iterations
default   [  61% ] 057/100 VUs  0m43.0s/1m10.0s

running (0m44.0s), 059/100 VUs, 866 complete and 0 interrupted iterations
default   [  63% ] 059/100 VUs  0m44.0s/1m10.0s

running (0m45.0s), 062/100 VUs, 925 complete and 0 interrupted iterations
default   [  64% ] 062/100 VUs  0m45.0s/1m10.0s

running (0m46.0s), 064/100 VUs, 987 complete and 0 interrupted iterations
default   [  66% ] 064/100 VUs  0m46.0s/1m10.0s

running (0m47.0s), 067/100 VUs, 1051 complete and 0 interrupted iterations
default   [  67% ] 067/100 VUs  0m47.0s/1m10.0s

running (0m48.0s), 069/100 VUs, 1118 complete and 0 interrupted iterations
default   [  69% ] 069/100 VUs  0m48.0s/1m10.0s

running (0m49.0s), 072/100 VUs, 1187 complete and 0 interrupted iterations
default   [  70% ] 072/100 VUs  0m49.0s/1m10.0s

running (0m50.0s), 074/100 VUs, 1259 complete and 0 interrupted iterations
default   [  71% ] 074/100 VUs  0m50.0s/1m10.0s

running (0m51.0s), 077/100 VUs, 1333 complete and 0 interrupted iterations
default   [  73% ] 077/100 VUs  0m51.0s/1m10.0s

running (0m52.0s), 079/100 VUs, 1410 complete and 0 interrupted iterations
default   [  74% ] 079/100 VUs  0m52.0s/1m10.0s

running (0m53.0s), 082/100 VUs, 1489 complete and 0 interrupted iterations
default   [  76% ] 082/100 VUs  0m53.0s/1m10.0s

running (0m54.0s), 084/100 VUs, 1571 complete and 0 interrupted iterations
default   [  77% ] 084/100 VUs  0m54.0s/1m10.0s

running (0m55.0s), 087/100 VUs, 1655 complete and 0 interrupted iterations
default   [  79% ] 087/100 VUs  0m55.0s/1m10.0s

running (0m56.0s), 089/100 VUs, 1742 complete and 0 interrupted iterations
default   [  80% ] 089/100 VUs  0m56.0s/1m10.0s

running (0m57.0s), 092/100 VUs, 1831 complete and 0 interrupted iterations
default   [  81% ] 092/100 VUs  0m57.0s/1m10.0s

running (0m58.0s), 094/100 VUs, 1923 complete and 0 interrupted iterations
default   [  83% ] 094/100 VUs  0m58.0s/1m10.0s

running (0m59.0s), 097/100 VUs, 2008 complete and 0 interrupted iterations
default   [  84% ] 097/100 VUs  0m59.0s/1m10.0s

running (1m00.0s), 099/100 VUs, 2105 complete and 0 interrupted iterations
default   [  86% ] 099/100 VUs  1m00.0s/1m10.0s

running (1m01.0s), 098/100 VUs, 2204 complete and 0 interrupted iterations
default   [  87% ] 098/100 VUs  1m01.0s/1m10.0s

running (1m02.0s), 088/100 VUs, 2302 complete and 0 interrupted iterations
default   [  89% ] 088/100 VUs  1m02.0s/1m10.0s

running (1m03.0s), 078/100 VUs, 2390 complete and 0 interrupted iterations
default   [  90% ] 078/100 VUs  1m03.0s/1m10.0s

running (1m04.0s), 068/100 VUs, 2468 complete and 0 interrupted iterations
default   [  91% ] 068/100 VUs  1m04.0s/1m10.0s

running (1m05.0s), 057/100 VUs, 2536 complete and 0 interrupted iterations
default   [  93% ] 057/100 VUs  1m05.0s/1m10.0s

running (1m06.0s), 045/100 VUs, 2593 complete and 0 interrupted iterations
default   [  94% ] 045/100 VUs  1m06.0s/1m10.0s

running (1m07.0s), 035/100 VUs, 2638 complete and 0 interrupted iterations
default   [  96% ] 035/100 VUs  1m07.0s/1m10.0s

running (1m08.0s), 025/100 VUs, 2673 complete and 0 interrupted iterations
default   [  97% ] 025/100 VUs  1m08.0s/1m10.0s

running (1m09.0s), 018/100 VUs, 2698 complete and 0 interrupted iterations
default   [  99% ] 018/100 VUs  1m09.0s/1m10.0s

running (1m10.0s), 008/100 VUs, 2716 complete and 0 interrupted iterations
default   [ 100% ] 008/100 VUs  1m10.0s/1m10.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<800' p(95)=5.82ms

    http_req_failed
    ✗ 'rate<0.02' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 8172   116.004151/s
    checks_succeeded...: 66.66% 5448 out of 8172
    checks_failed......: 33.33% 2724 out of 8172

    ✗ GET /health is 200
      ↳  0% — ✓ 0 / ✗ 2724
    ✓ GET /auth/login not 5xx
    ✓ GET /colis/commandes not 5xx

    HTTP
    http_req_duration....: avg=2.05ms min=263µs med=993µs max=212.53ms p(90)=3.99ms p(95)=5.82ms
    http_req_failed......: 100.00% 8172 out of 8172
    http_reqs............: 8172    116.004151/s

    EXECUTION
    iteration_duration...: avg=1s     min=1s    med=1s    max=1.24s    p(90)=1.01s  p(95)=1.01s 
    iterations...........: 2724    38.66805/s
    vus..................: 8       min=1            max=99 
    vus_max..............: 100     min=100          max=100

    NETWORK
    data_received........: 1.3 MB  18 kB/s
    data_sent............: 657 kB  9.3 kB/s



running (1m10.4s), 000/100 VUs, 2724 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m10s